{"name":"Sessimè Orias","headerTaglineOne":"Bonjour 👋","headerTaglineTwo":"Je suis Sessimè Orias","headerTaglineThree":"Developpeur Full Stack","headerTaglineFour":"","showCursor":false,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/ORiVS/"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/orias-dogbevi-699a1620b/"},{"id":"5","title":"Email","link":"mailto:orivsdogbevi@gmail.com"}],"projects":[{"id":"1","title":"ManageU – API REST complète en Django","description":"API REST sécurisée en Django pour gérer utilisateurs, produits et commandes. Authentification JWT, permissions avancées, CRUD complet, pagination et documentation Swagger intégrée.","imageSrc":"/images/manageU.png","url":"/projects/manageU"},{"id":"2","title":"AHIKAN – Marketplace mobile made in Bénin","description":"App Flutter + backend Django dédiée au marché béninois. Produits, vendeurs, paiement sécurisé et moteur de recherche avancé sur PostgreSQL.","imageSrc":"/images/AHIKAN.png","url":"/projects/ahikan"},{"id":"3","title":"LeMaillotAPI – API e-commerce pour maillots de football","description":"API Django REST pour application mobile Flutter. Authentification JWT, panier, commandes, backoffice vendeur et paiement intégré.","imageSrc":"/images/HomePage.png","url":"/projects/lemaillot"},{"id":"4","title":"ESGIX – Mini Twitter mobile avec Flutter","description":"Application mobile Flutter connectée à une API tierce pour gérer comptes, posts, likes, commentaires, profils et recherche avec debouncing. Authentification sécurisée via API Key + JWT. Architecture BLoC","imageSrc":"/images/esgix.png","url":"/projects/esgix"},{"id":"5","title":"Groupe – Application Java Spring de gestion de parking","description":"Application collaborative (Spring Boot + PostgreSQL) de réservation de parking avec authentification, dashboard admin, logs de connexion, gestion d’agenda.","imageSrc":"/images/parking.png","url":"/projects/groupe"},{"id":"6","title":"KY Platform – Refonte plateforme B2B avec Node.js","description":"Refonte technique d’une plateforme web avec Node.js, PostgreSQL et CI/CD AWS. Ajout de fonctionnalités, gestion d’équipe Agile, scripts Python pour automatiser la gestion de stock.","imageSrc":"/images/refonte.png","url":"/projects/refonte-node"},{"id":"6c365cfd-4d7b-4ced-94fe-32360380302c","title":"SnakeWars – Reinforcement Learning Game","description":"Jeu Snake avec IA par apprentissge par renforcement, développé en Python et présenté lors d'un projet académique à l’ESGI.","imageSrc":"/images/snake.png","url":"/projects/snakewars"}],"services":[{"id":"1","title":"Développement Backend","description":"Conception d’APIs REST robustes, sécurisées et documentées avec Django, Node.js ou Spring Boot. Authentification JWT, gestion des rôles, pagination, filtres avancés et CI/CD intégrés."},{"id":"2","title":"Développement Mobile Flutter","description":"Création d’interfaces mobiles performantes avec Flutter. Intégration complète avec APIs, gestion de l’état, authentification, panier, recherche et animations fluides."},{"id":"3","title":"Architecture Logicielle & DevOps","description":"Structuration d’architectures scalables, séparation des responsabilités, mise en place de pipelines CI/CD avec GitHub Actions et déploiement Dockerisé sur AWS ou VPS."},{"id":"4","title":"Gestion de projet Agile","description":"Encadrement de projets techniques avec les méthodologies Scrum et Kanban. Utilisation d’outils collaboratifs (Trello, Notion, Jira), sprints, et suivi des livrables."},{"id":"321b5b8d-c9b6-41c7-9532-384e7e43b663","title":"Développement Frontend","description":"Création d’interfaces web modernes avec React.js et Angular. Responsive design, intégration d’APIs, optimisation des performances et accessibilité."}],"aboutpara":"Actuellement en Master 2 d’architecture des logiciels à l’ESGI Paris, je suis développeur full stack avec une forte appétence pour les projets structurés, les bonnes pratiques de développement et les environnements techniques exigeants. J’ai mené des projets concrets en Django, Flutter, PostgreSQL, Node.js, tout en intégrant des outils de CI/CD, de gestion d’API sécurisée (JWT) et d’approches DevOps.\n\nÀ travers mes expériences en alternance et mes projets entrepreneuriaux, j’ai appris à collaborer en équipe agile, à livrer des features fonctionnelles et stables, et à prendre en main des architectures complexes, que ce soit côté web ou mobile. Je suis aujourd’hui à la recherche d’un CDI stimulant où je pourrai continuer à progresser, contribuer activement à des produits solides, et évoluer aux côtés d’ingénieurs passionnés.","resume":{"tagline":"👋 Je suis développeur full stack spécialisé en architectures web et mobiles.","description":"Je conçois et développe des applications performantes en backend (Django, Node.js) et frontend (React, Flutter), avec une forte culture DevOps et Agile. Je suis à la recherche d’un CDI dans un environnement stimulant où je pourrai contribuer activement à des produits solides et à impact.","experiences":[{"id":"1","dates":"Septembre 2024 - Aujourd’hui","type":"Alternance","position":"Développeur Full Stack – KY Solutions, Paris","bullets":"Refonte d’une plateforme web en Node.js et PostgreSQL, Déploiement cloud via AWS et CI/CD, Développement mobile avec Flutter (front) et Laravel (back), Optimisation de scripts Python pour la gestion de stock,  Travail en équipe Agile (Scrum)"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"Avril 2023 - Août 2023","type":"Stage","position":"Développeur Web & Mobile – INOVACT, Cotonou","bullets":"Création d’une API backend en Django Python, Développement front & back d’un site web complet, Design fonctionnel et intégration de fonctionnalités sur mesure"}],"education":{"universityName":"ESGI Paris","universityDate":"2023 - 2025","universityPara":"Master 2 en architecture des logiciels. Conception et développement de solutions applicatives complexes, avec spécialisation backend/DevOps."},"languages":["Javascript","HTML5","CSS","Python","SQL"],"frameworks":["React","React","NodeJs","Flutter","Spring Boot","Angular"],"others":["Docker","AWS","CI/CD","Postman","Trello","Github Actions"]}}